{
  "hello": "hello",
  "How are you?": "I am fine, what about you?",
  "What is your name?": "My name is Advance MIAB created by Michael Moses. Currently, I have limited knowledge on responses. Feel free to add your responses.",
  "What can you do?": "I can answer questions related to banking services and provide information.",
  "What is your favorite color?": "I don't have a favorite color, but I like the color blue.",
  "What is your favorite food?": "As a chatbot, I don't eat, but I've heard Ugali is a popular choice.",
  "What is your favorite animal?": "I like cats. They are independent and curious.",
  "What is your favorite sport?": "I don't have a favorite sport, but I can help you with sports-related questions.",
  "What is your favorite movie?": "I don't watch movies, but I've heard many people like 'Inception'.",
  "sorry": "It's alright, no problem at all. What can I do for you?",
  "My name is Florence": "Hello nice to meet you fellah. How can I help you today?",
  "hello my name is Mike": "Hello, nice to meet you. How can I help you today?",
  "Who is Michael Moses": "Michael Moses is my creator. He is 20 years old. He has a dark complexion with cute black hair. He lives in Dagoretti South. For more info about him, visit https://github.com/micymike/my-website/blob/main/public/about.html.",
  "I am fine too": "That's wonderful. Tell me how I can be of help today?",
  "What is the capital of France?": "The capital of France is Paris.",
  "What is the square root of 16?": "The square root of 16 is 4.",
  "What is the tallest mountain in the world?": "Mount Everest is the tallest mountain in the world.",
  "Ibrahim Odiambo": "He is Michael Moses' brother.",
  "who is ibrahim": "He is Mike's brother.",
  "hi": "hi",
  "": "you did not type anything",
  ".": "Full stop or a period, it is used when you want to end a sentence.",
  "What is the population of the world?": "As of 2023, the estimated global population is around 7.8 billion people.",
  "Who was the first person to walk on the moon?": "Neil Armstrong was the first person to walk on the moon on July 20, 1969.",
  "What is the largest planet in our solar system?": "Jupiter is the largest planet in our solar system",
  "What is the largest living thing on earth?": "The largest living thing on earth is a fungus called Armillaria ostoyae",
  "What is the largest mammal on earth?": "The largest mammal on earth is the blue whale",
  "What is the largest bird on earth?": "The largest bird on earth is the ostrich",
  "What is the largest reptile on earth?": "The largest reptile on earth is the saltwater crocodile",
  "What is the largest fish on earth?": "The largest fish on earth is the whale shark",
  "What is the largest insect on earth?": "The largest insect on earth is the Goliath beetle",
  "who is the first president of Kenya?": "Johnson kamau alias Mzee Jomo Kenyatta was the first president of kenya. ",
  "What is the largest ocean on Earth?": "The Pacific Ocean is the largest ocean on Earth.",
  "What is the speed of light?": "The speed of light in a vacuum is approximately 299,792 kilometers per second (km/s).",
  "Who wrote 'To Kill a Mockingbird'?": "'To Kill a Mockingbird' was written by Harper Lee.",
  "What is the chemical symbol for gold?": "The chemical symbol for gold is Au.",
  "What is the smallest country in the world?": "Vatican City is the smallest country in the world.",
  "What is the longest river in the world?": "The Nile River is commonly regarded as the longest river in the world.",
  "What is the hottest planet in our solar system?": "Venus is the hottest planet in our solar system.",
  "Who painted the Mona Lisa?": "The Mona Lisa was painted by Leonardo da Vinci.",
  "What is the largest mammal in the world?": "The blue whale is the largest mammal in the world.",
  "What is the hardest natural substance on Earth?": "Diamond is the hardest natural substance on Earth.",
  "What is the capital of Japan?": "The capital of Japan is Tokyo.",
  "What is the freezing point of water?": "The freezing point of water is 0 degrees Celsius or 32 degrees Fahrenheit.",
  "What is the largest desert in the world?": "The Sahara Desert is the largest hot desert in the world.",
  "Who was Albert Einstein?": "Albert Einstein was a theoretical physicist known for developing the theory of relativity.",
  "What is the main ingredient in sushi?": "The main ingredient in sushi is usually rice, often accompanied by fish, vegetables, and seaweed.",
  "What is the tallest building in the world?": "As of 2023, the Burj Khalifa in Dubai is the tallest building in the world.",
  "Who wrote '1984'?": "'1984' was written by George Orwell.",
  "What is the chemical symbol for water?": "The chemical symbol for water is H2O.",
  "What is the largest island in the world?": "Greenland is the largest island in the world.",
  "Who is the author of 'Harry Potter'?": "The 'Harry Potter' series was written by J.K. Rowling.",
  "What is the national dish of Japan?": "Sushi is often considered the national dish of Japan.",
  "What is the primary language spoken in Brazil?": "The primary language spoken in Brazil is Portuguese.",
  "What is the distance between the Earth and the Sun?": "The average distance between the Earth and the Sun is about 93 million miles (150 million kilometers).",
  "What is the primary ingredient in bread?": "The primary ingredient in bread is flour.",
  "What is the boiling point of water?": "The boiling point of water is 100 degrees Celsius or 212 degrees Fahrenheit.",
  "Who discovered penicillin?": "Penicillin was discovered by Alexander Fleming.",
  "What is the capital of Australia?": "The capital of Australia is Canberra.",
  "What is the chemical formula for salt?": "The chemical formula for table salt is NaCl.",
  "What is the national sport of Canada?": "Ice hockey is considered the national winter sport of Canada.",
  "What is the primary ingredient in chocolate?": "The primary ingredient in chocolate is cocoa.",
  "What is the highest-grossing film of all time?": "As of 2023, 'Avengers: Endgame' is the highest-grossing film of all time.",
  "Who wrote 'Pride and Prejudice'?": "'Pride and Prejudice' was written by Jane Austen.",
  "What is the chemical symbol for oxygen?": "The chemical symbol for oxygen is O.",
  "What is the national flower of Japan?": "The cherry blossom (sakura) is the national flower of Japan.",
  "What is the main ingredient in guacamole?": "The main ingredient in guacamole is avocado.",
  "Who invented the telephone?": "The telephone was invented by Alexander Graham Bell.",
  "What is the capital of Italy?": "The capital of Italy is Rome.",
  "What is the chemical symbol for carbon?": "The chemical symbol for carbon is C.",
  "chemical symbol for table salt": "sorry did you mean chemical formula??",
  "ooh yes I did": "The chemical formula for table salt is NaCl.",
  "miab": "yes how can i help you today?",
  "favorite sport": "football",
  "what is javascript": "JavaScript, often abbreviated as JS, is a programming language and core technology of the Web, alongside HTML and CSS. 99% of websites use JavaScript on the client side for webpage behavior. Web browsers have a dedicated JavaScript engine that executes the client code. These engines are also utilized in some servers and a variety of apps. The most popular runtime system for non-browser usage is Node.js. JavaScript is a high-level, often just-in-time compiled language that conforms to the ECMAScript standard.",
  "what is google": "Google LLC is an American multinational corporation and technology company focusing on online advertising, search engine technology, cloud computing, computer software, quantum computing, e-commerce, consumer electronics, and artificial intelligence. It has been referred to as \"the most powerful company in the world\" and is one of the world's most valuable brands due to its market dominance, data collection, and technological advantages in the field of AI. Google's parent company, Alphabet Inc. is one of the five Big Tech companies, alongside Amazon, Apple, Meta, and Microsoft.",
  "lenovo": "Error: Incorrect API key provided: your_ope*******_key. You can find your API key at https://platform.openai.com/account/api-keys."
}